package io.lesible.model.response.product;

import lombok.Data;

import java.util.List;

/**
 * 化妆品生产许可证	6921664838129287432
 * <p>
 * 消毒产品生产企业卫生许可证	6921664837953143053
 * <p>
 * 国产普化备案电子凭证	6921664838087360775
 * <p>
 * 进口普化备案电子凭证	6921664838116720904
 * <p>
 * 国产特化行政许可批件	6921664838129156360
 * <p>
 * 进口特化行政许可批件	6921664838129172744
 * <p>
 * 消毒产品卫生许可批件	6924586049331052807
 * <p>
 * 动物检验检疫证明	6921664838158565645
 * <p>
 * 动物防疫条件合格证	6921664838158582029
 * <p>
 * 中华老字号认证证书	6921664838158598413
 * <p>
 * 绿色食品认证证书	6921664838187893006
 * <p>
 * 有机食品认证证书	6921664838158631181
 * <p>
 * 国家地理标志登记证书	6945801625692946732
 * <p>
 * 农产品地理标志登记证书	6921664838187876622
 * <p>
 * 无公害农产品认证证书	6921664838158647565
 * <p>
 * 报关单	3457058919409648559
 * <p>
 * 入境货物检验检疫证明	3457058930256138323
 * <p>
 * 委托进口协议	3457058936748903145
 * <p>
 * 质检报告	3457058945162709852
 * <p>
 * 赠品资质	6945746852176363820
 * <p>
 * 进口音像制品批准单	6945801625692963116
 * <p>
 * 饲料生产许可证	6921664837978161416
 * <p>
 * 进口饲料登记证	6921664838187974926
 * <p>
 * 全国工业产品生产许可证	6921664837978210568
 * <p>
 * 电动自行车产品合格证	6945801625692979500
 * <p>
 * 机动车整车出厂合格证	6945801625692995884
 * <p>
 * 道路机动车辆生产企业及产品公告	6945801625693012268
 * <p>
 * 道路机动车辆生产企业许可	6945801625693028652
 * <p>
 * 食品生产许可证	6921664837978194184
 * <p>
 * 商品核酸检测报告	6921664838129221896
 * <p>
 * 经营者消毒证明	6921664838129303816
 * <p>
 * 原产地证明	6921664838158614797
 * <p>
 * 农业转基因生物安全证书	6921664838158663949
 * <p>
 * 委托加工协议	3457058906575125902
 * <p>
 * 人物肖像授权资质	6924586049331085575
 * <p>
 * 鉴定证书	6924586049331003655
 * <p>
 * CCC安全认证证书	6921664838028542215
 * <p>
 * 保健食品生产企业卫生许可证	6921664838028525831
 * <p>
 * 单用途预付卡备案证明	6921664838028509447
 * <p>
 * 职业资格证	6921664837953028365
 * <p>
 * 酒类/食品生产许可证	3457058852837717978
 * <p>
 * 农作物种子生产许可证	6921664837952995597
 * <p>
 * 林木种子生产许可证	6921664837953011981
 * <p>
 * 执业兽医师资格证书	6921664837953044749
 * <p>
 * 证券从业资格证	6921664837953077517
 * <p>
 * 医疗器械生产许可证	6921664837953093901
 * <p>
 * 医疗器械生产企业许可证	6921664837953110285
 * <p>
 * 兽药生产许可证	6921664837978177800
 * <p>
 * 农药产品生产许可证	6921664837978226952
 * <p>
 * 旅游景区质量等级证书	6921664837978243336
 * <p>
 * 律师职业资格证书	6921664837978259720
 * <p>
 * 开锁特种行业许可证	6921664837978276104
 * <p>
 * 合作协议	6921664837978308872
 * <p>
 * 肥料生产许可证	6921664838028493063
 * <p>
 * 教育行政部门备案	6921664838028558599
 * <p>
 * 医疗机构职业许可	6921664837953126669
 * <p>
 * 肥料产品登记证	6921664838116638984
 * <p>
 * 讲师资格证明	6921664838116622600
 * <p>
 * 保健食品批准证书	6921664838116704520
 * <p>
 * 保险协议或保单	6921664838116688136
 * <p>
 * 卡券承诺函	6921664838087344391
 * <p>
 * 保险证明	6921664838116671752
 * <p>
 * 食品券承诺函	6921664838087295239
 * <p>
 * 质检师雇佣合同	6921664838028574983
 * <p>
 * 医疗器械网络销售备案凭证	6921664838028591367
 * <p>
 * 婴幼儿配方乳粉注册证书	6924586049331020039
 * <p>
 * 线下门店证明	6921664838028624135
 * <p>
 * 无线电发射设备型号核准证	6924586049331036423
 * <p>
 * 网络销售与实名制授权书	6921664838087213319
 * <p>
 * 饲料产品批准文号	6921664838087229703
 * <p>
 * 水产品卫生许可批件	3457507840154021026
 * <p>
 * 兽用生物制品进口许可证	6921664838087246087
 * <p>
 * 兽药产品批准证书	6921664838087262471
 * <p>
 * 兽药GMP证书	6921664838087278855
 * <p>
 * 室内装饰企业资质证书	6921664838087311623
 * <p>
 * 企业标准产品备案	6921664838087328007
 * <p>
 * 农药登记证	6921664838116573448
 * <p>
 * 教师职业资格证	6921664838116589832
 * <p>
 * 鉴定师证书	6921664838116606216
 * <p>
 * 电信设备进网许可证	3457058968927612124
 * <p>
 * ICP/增值电信业务经营许可证	6924586049331069191
 * <p>
 * 劳务关系证明	6921664838129271048
 * <p>
 * 验光设备年度检定证书	6921664838129189128
 * <p>
 * 签约合同	6921664838129238280
 * <p>
 * 农产品检测报告	6921664838129254664
 * <p>
 * 鉴定师雇佣合同	6921664838158516493
 * <p>
 * 特有工种职业技能鉴定站备案	6921664838158532877
 * <p>
 * 动物诊疗许可证	6921664838158549261
 * <p>
 * 种植证明/收购合同	6921664838187909390
 * <p>
 * 种子进口贸易资格证	6921664838187925774
 * <p>
 * 进口医疗器械注册登记表	6921664838187942158
 * <p>
 * 进口医疗器械产品注册证	6921664838187958542
 * <p>
 * 进口兽药注册证书	6921664838187991310
 * <p>
 * 生猪定点屠宰证	6921664838129205512
 *
 * <p> @date: 2021-04-22 18:25</p>
 *
 * @author 何嘉豪
 */
@Data
public class Quality {

    private String qualityName;
    private List<QualityAttachment> qualityAttachments;
    private String qualityKey;

}
